In [276]:
#Importing dependancies
import numpy as np
import scipy.stats as st
import pandas as pd

### Problem 1

In [277]:
data = {"High School":[60,40,100],"Bachelors":[54,44,98], "Masters":[46,53,99], "Ph.d":[41,57,98], "Total":[201,194,395]}
df1 = pd.DataFrame(data, index=["Female","Male","Total"])
df1

        High School  Bachelors  Masters  Ph.d  Total
Female           60         54       46    41    201
Male             40         44       53    57    194
Total           100         98       99    98    395

**Hypothesis for level of education**
* H0: There is a relationship between the respondants level of education.
* H1: There is no relationship between the respondants level of education.

**Hypothesis for gender**
* H0: There is a relationship between the respondants gender.
* H1: There is no relationship between the respondants gender.

In [278]:
df = df1.iloc[:2, :4]
df

        High School  Bachelors  Masters  Ph.d
Female           60         54       46    41
Male             40         44       53    57

In [279]:
n = (df.shape[0] * df.shape[1]) #no of records
k_col = df.shape[1]-1
k_rows = df.shape[0]

dfn = (k_col-1)*(k_rows-1)
dfd = n-(k_col*k_rows)
alpha - 0.05

0.0

In [280]:
grand_mean = np.mean([df.loc['Female'].mean(),df.loc['Male'].mean()])
print("Grand mean: ",grand_mean)

Grand mean:  49.375

In [281]:
female_mean = df.loc['Female'].mean()
male_mean = df.loc['Male'].mean()
hs_mean = np.mean(df['High School'])
bach_mean = np.mean(df['Bachelors'])
mast_mean = np.mean(df['Masters'])
phd_mean = np.mean(df['Ph.d'])

In [282]:
df

        High School  Bachelors  Masters  Ph.d
Female           60         54       46    41
Male             40         44       53    57

In [283]:
ss_between_edu = (2*np.square(df.iloc[0,0]-hs_mean))+(2*np.square(df.iloc[1,0]-hs_mean))+(2*np.square(df.iloc[0,1]-bach_mean))+(2*np.square(df.iloc[1,1]-bach_mean))+(2*np.square(df.iloc[0,2]-mast_mean))+(2*np.square(df.iloc[1,2]-mast_mean))+(2*np.square(df.iloc[0,3]-phd_mean))+(2*np.square(df.iloc[1,3]-phd_mean))
msst_edu = ss_between_edu/3
msst_edu

268.3333333333333

In [284]:
s1=0
s2=0
for i in range(4):
    s1 += 4*(np.square(df.iloc[0,i]-female_mean))
for j in range(4):
    s2 += 4*(np.square(df.iloc[1,j]-male_mean))

ss_between_gender = s1+s2
msst_gender = ss_between_gender/1
msst_gender

1591.0

In [285]:
tss=0
for i in [0,1]:
    for j in [0,1]:
        tss += np.square(df.iloc[i,j]-grand_mean)
tss

251.0625

In [287]:
sse = tss - (ss_between_edu + ss_between_gender)
msse = sse/dfn
msse

-1072.46875

In [288]:
f_edu = msst_edu/msse
f_gender = msst_gender/msse
f_critical = st.f.isf(q=alpha, dfn=dfn, dfd=dfd)
print(f"F-statistic for \nEducation level: {f_edu} \nGender: {f_gender} \nF-critical: {f_critical}")

F-statistic for
Education level: -0.2502015404489253
Gender: -1.4834931087735657
F-critical: 18.999999999999982

### Problem 2

In [156]:
data = {"Group1":[51,45,33,45,67], "Group2":[23,43,23,43,45], "Group3":[56,76,74,87,56]}
alpha = 0.05

df = pd.DataFrame(data)
df

   Group1  Group2  Group3
0      51      23      56
1      45      43      76
2      33      23      74
3      45      43      87
4      67      45      56

In [157]:
#H0: There is a relationship between the groups
#H1: There is no relationship between the groups

n = (df.shape[0] * df.shape[1]) #no of records
k = len(df.columns)
print(f"n:{n}, k:{k}")

n:15, k:3

In [148]:
col_names = list(df.columns)
# Calculating the variances
for col in col_names: 
    name1 = col+"_var"
    df[name1] = np.square(df[col] - np.mean(df[col]))
df

   Group1  Group2  Group3  Group1_var  Group2_var  Group3_var
0      51      23      56        7.84      153.76      190.44
1      45      43      76       10.24       57.76       38.44
2      33      23      74      231.04      153.76       17.64
3      45      43      87       10.24       57.76      295.84
4      67      45      56      353.44       92.16      190.44

In [149]:
col_names_new = list(df.columns)
# Calculating the total sum
sum = []
for column in col_names_new:
    sum.append(df[column].sum())

row = {}
for i in range(len(col_names_new)):
    row[str(col_names_new[i])] = sum[i]

df1 = pd.DataFrame(row, index=['Total'])
df = df.append(df1)
df

       Group1  Group2  Group3  Group1_var  Group2_var  Group3_var
0          51      23      56        7.84      153.76      190.44
1          45      43      76       10.24       57.76       38.44
2          33      23      74      231.04      153.76       17.64
3          45      43      87       10.24       57.76      295.84
4          67      45      56      353.44       92.16      190.44
Total     241     177     349      612.80      515.20      732.80

In [150]:
# Calculating group means and grand mean
dict={}
for col in col_names:
    name2 = col +"_mean"
    dict[name2] = np.mean(df[col])

k_list = list(dict.keys())
v_list = list(dict.values())

df1 = pd.DataFrame(dict, index=[0])

grand_mean = np.mean(v_list)
print("Grand mean: ", grand_mean)
df1

Grand mean:  85.22222222222221

   Group1_mean  Group2_mean  Group3_mean
0    80.333333         59.0   116.333333

In [152]:
# Calculating variability between groups
dfn = k-1
ss_between=0
for col in df1.columns:
    ss_between += (len(df)-1)*np.square(df1[col]-grand_mean)

msst = ss_between/dof
msst

0    4198.518519
Name: Group1_mean, dtype: float64

In [153]:
# Calculating variability within the groups
dfd = n-k
ss_within = 0
for total in df.loc['Total'][3:]:
    ss_within += total

msse = ss_within/(n-k)
msse

155.06666666666666

In [168]:
f_statistic = msst/msse
f_critical = st.f.isf(q=alpha, dfn=dfn, dfd=dfd)

print(f"F-statistic: {f_statistic} \n\nF-critical: {f_critical}")

F-statistic: 0    25.0
Name: A_mean, dtype: float64

F-critical: 5.317655071578714

#### Inference
Since  F-statistics  falls  within  the  critical  region,  we  reject  the  null  hypothesis.

Therefore,  we  conclude  that  there  is  sufficient  evidence  to  prove  that  there  is  no  relationship  between  the  groups.

### Problem 3

In [159]:
data = {"A":[10,20,30,40,50], "B":[5,10,15,20,25]}
df = pd.DataFrame(data)
df

    A   B
0  10   5
1  20  10
2  30  15
3  40  20
4  50  25

In [160]:
#H0: There is a relationship between the groups
#H1: There is no relationship between the groups

n = (df.shape[0] * df.shape[1]) #no of records
k = len(df.columns)
print(f"n:{n}, k:{k}")

n:10, k:2

In [161]:
col_names = list(df.columns)
# Calculating the variances
for col in col_names: 
    name1 = col+"_var"
    df[name1] = np.square(df[col] - np.mean(df[col]))
df

    A   B  A_var  B_var
0  10   5  400.0  100.0
1  20  10  100.0   25.0
2  30  15    0.0    0.0
3  40  20  100.0   25.0
4  50  25  400.0  100.0

In [162]:
col_names_new = list(df.columns)
# Calculating the total sum
sum = []
for column in col_names_new:
    sum.append(df[column].sum())

row = {}
for i in range(len(col_names_new)):
    row[str(col_names_new[i])] = sum[i]

df1 = pd.DataFrame(row, index=['Total'])
df = df.append(df1)
df

         A   B   A_var  B_var
0       10   5   400.0  100.0
1       20  10   100.0   25.0
2       30  15     0.0    0.0
3       40  20   100.0   25.0
4       50  25   400.0  100.0
Total  150  75  1000.0  250.0

In [163]:
# Calculating group means and grand mean
dict={}
for col in col_names:
    name2 = col +"_mean"
    dict[name2] = np.mean(df[col])

k_list = list(dict.keys())
v_list = list(dict.values())

df1 = pd.DataFrame(dict, index=[0])

grand_mean = np.mean(v_list)
print("Grand mean: ", grand_mean)
df1

Grand mean:  37.5

   A_mean  B_mean
0    50.0    25.0

In [164]:
# Calculating variability between groups
dfn = k-1
ss_between=0
for col in df1.columns:
    ss_between += (len(df)-1)*np.square(df1[col]-grand_mean)

msst = ss_between/dof
msst

0    781.25
Name: A_mean, dtype: float64

In [165]:
# Calculating variability within the groups
dfd = n-k
ss_within = 0
for total in df.loc['Total'][3:]:
    ss_within += total

msse = ss_within/(n-k)
msse

31.25

In [169]:
f_statistic = msst/msse
f_critical = st.f.isf(q=alpha, dfn=dfn, dfd=dfd)

print(f"F-statistic: {f_statistic} \n\nF-critical: {f_critical}")

F-statistic: 0    25.0
Name: A_mean, dtype: float64

F-critical: 5.317655071578714

#### Inference
Since  F-statistics  falls  within  the  critical  region,  we  reject  the  null  hypothesis.

Therefore,  we  conclude  that  there  is  sufficient  evidence  to  prove  that  there  is  no  relationship  between  the  groups.